[
    {
      "id": "PO1",
      "description": "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to solve complex engineering problems."
    },
    {
      "id": "PO2",
      "description": "Problem analysis: Identify, formulate, and analyze complex engineering problems to reach substantiated conclusions using first principles of mathematics and engineering sciences."
    },
    {
      "id": "PO3",
      "description": "Design/development of solutions: Design solutions for complex engineering problems and design system components or processes to meet the specified needs with appropriate consideration for public health and safety, and cultural, societal, and environmental considerations."
    },
    {
      "id": "PO4",
      "description": "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions."
    },
    {
      "id": "PO5",
      "description": "Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools, including prediction and modeling, to complex engineering activities, with an understanding of the limitations."
    },
    {
      "id": "PO6",
      "description": "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal, and cultural issues and the consequent responsibilities relevant to professional engineering practice."
    },
    {
      "id": "PO7",
      "description": "Environment and sustainability: Understand the impact of professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development."
    },
    {
      "id": "PO8",
      "description": "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice."
    },
    {
      "id": "PO9",
      "description": "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings."
    },
    {
      "id": "PO10",
      "description": "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions."
    },
    {
      "id": "PO11",
      "description": "Project management and finance: Demonstrate knowledge and understanding of engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments."
    },
    {
      "id": "PO12",
      "description": "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change."
    }
  ]
  